AcGiSkyBackgroundTraits.skyParameters(AcGiSkyParameters*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Provides access to sky parameters for this light.
params:
An AcGiSkyParameters object that contains the sky properties used
by this background.

AcGiSkyBackgroundTraits.setSkyParameters(AcGiSkyParameters!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sets the sky parameters for this light.
params:
An AcGiSkyParameters object that contains the sky properties used
by this background.

AcGiSkyBackgroundTraits
This class enables sky background definitions to be elaborated to
AcGi implementations.